<template>
    <div class="collect-page-top">
        <van-row justify="space-between">
            <van-col>
                <BackIcon />
            </van-col>
            <van-col>
                <BookShare :data="{ iconName: 'ellipsis' }" ref="bookShare" />
            </van-col>
        </van-row>
        <van-row>
            <van-col>{{ list.bookmarkList[0].folderTitle }}</van-col>
            <van-col v-if="list.bookmarkList[0].power === 1"><van-icon name="bag" /></van-col>
        </van-row>
        <van-text-ellipsis :content="list.bookmarkList[0].depict" />
    </div>
    <div class="collect-page-main">
        <p class="explain">{{ list.bookmarkList[0].childrenNum }}个内容</p>
        <CollectItem @share="onShare" v-for="(item, index) in list.collectList" :key="item.id" :item="item"
         :bookmarkList="list.bookmarkList" @update="updateItem" hideFolderTitle="true"/>
    </div>

    <!-- 新建/编辑文件夹 弹框 -->
    <BookmarkPopup @update="updateBookmark" @close="closeBookmarkPopup" :data="bookmarkItemObj" :type="addEditRef"
        :nextId="lastBookmarkId" :show="isShowCreate" />
</template>
<script setup>
import BookShare from '@/components/BookShare/Index.vue'
import BackIcon from '@/components/BackIcon.vue'
import CollectItem from './component/Collect/CollectItem.vue'
import { ref, watch, provide } from 'vue';
import BookmarkPopup from './component/Collect/BookmarkPopup.vue'
// import { fetchCollectList } from '@/api/recent.js';
//收藏夹列表
const list = ref({
    allNum: 4,
    bookmarkList: [
        {
            folderTitle: '口构采律表强米出',
            power: 1,
            depict: '建这行期往对响素风五美精八半层体。完革并准万飞志严成得省区由到置据按。口易军计身点决思取色政决气联。提住物面商关带也称路她但物权。火入根得展气局片温研队高而安。结场天素传维量作三同工中酸二认专直。法院选它别以但作长从进拉律因度积复很。叫队信真问始万音号当器适己。指照己属入应作器对出料马着速价。飞是京以没拉那算代名备风务周带十保。求或极社取矿角地交七来记。元便次会一种候得习加上张领。建专类通参类用化在看面族中交新米问。划属列何么道长记厂家再指生看农家计。难亲满史强正该支无图认处农门细。更等周可置万矿部个总即事好快命。装所色动历众队高科广价定张总其示派。温活设们石通阶使压金知须千严适。更工你小品清素者速风般王系理正装。技信毛在铁过众建平最设何几。群山许采取重电离方便连划。变感速在结温系周还组强动设受离华名。提将圆算集料部作照走价些了周江家。价住务平路具代头九通组称义。资者话报斯权无代照期林清且事方周好。报最易离验对就书取感候难通。当认南劳却体写要回断风步队。七连经段先然好史有质求标具海加月们料。马交段备交结响看性县论她知毛。式代公际里府系主织几至二。保山容世采开七别向除计家议角准于。素不研节内团酸应声四众我历段务计次。它图红称手精名置般应准严全半级。到理常万还立江收据求关定当造常。细条世性角目资各支风示合认采。运两总保海列里般使现政农去目快。反些他政指程安建山队日集。金第区难得常受始料老科教正己。局关写口文论今反率利圆场带我飞系。什知强度边达等实门给会价对感加。样知争适由特见选机清参起一容表万气音。小数动来水事空自族金习约。准了六行行重指统还片状对决东。各候或关状处政例形律按广常切。法标图都太发基响住斯白北较。头上名方美往各接最度象由团加经即委。平数手百气半口确调社会强。议活土总队动东专百马而水计什转。图小现量路重南又今须越深。存京领活条技工办近般门长线证。而水起品斯斗文队过强么信织较据见七。本须说相每始严线生点性器利。在斗据来件年会研特压须斗得电色经会。义见文认事相变化王容了状化相。住原反教无就场想史外再知例。阶解面传准为路少行形物质名南较。八点育队二东计查快二可子查。学理查书般育此今技响效层米然五理速。文算取整新保六图影没六整领好装她断。各议选能自全快积市般值速气则较构。局再红眼志型形起须或流土极目文。影装候时影要知领空行眼车向越观业样间。自并增天什入分都金高机转确称报点。个世等规几基利斗自转传位多。相又出断开况基性带体采级求。心组细反治法基路子之积八学号。音同平第品色支养他少她照子厂治后。问十专林王八计又类认片规眼治。设将两先高政们电委明意得力米空空器前。角后走比利太花系受物业细报界身原。光开义己业业龙又华派都类规。每由动作证则类其口称高则划术文我合。体各经织只社内标近明子响农备后信广表。装约变基更合内火方带众存现安。系马入存化己经所不门价完先被。许效统石格近年受认同由了月样况。群社则日点领话研车你除自社半心资叫形。百织验斯子手广同高里阶白只表统。金两入亲取今程干义主感力着必院百。置适单团导段维身领统容一复约算。组就斗西收只集得在可安八机子他发。来关打回流原厂养理头包品先备统。整化式克青进持新京飞原头积委所市不王。种引都号度写老产识土种改光油压后区。果议最五究经比心通则究转电。效矿论原数府色书干手江直江有用同主月。根界叫质来院儿通工打质行南革。状九由很山住技布备了府低来间议地然。革立变走养果许理始广角名想。育利应放六子段近从利五响立心。而毛习情农发院采年种本备三。关农万水东照清使上性美我算斯争再己。人向应完圆别始力严期走他连通头。具总须习文加料县建适写个华了或张完。所计求每些院理列无系已并。号克按素安而期积酸选被七五调易写团。里听及同铁和造者来流公界此件要条。具导石西力拉铁起内于五情属平统矿己。作满许给听感连发车合改入快事收军县。条持油门五商共天流南今此住又。意习石论行风发南权应动效定。这火称利约却作时真光器思及。深适具或分接期养快六习马实加较色。支按边报话它要报除满当维什他北。办群认调张能大展万许用组。点层权了个活验周斯学政义强采第农。条广认油太细以备根六之色记。厂面义际统属们书满期能造容儿正程备。运响龙写市细研门保白向音他它。系青白方史则相记眼议由还十色。算电满料查很亲领风矿小细民。直西领器原都器权看想报知达们政因易。些果战只受厂元清备用包了场价习。油化道候动如放难积界今下当即建眼员。领气周格次铁阶达马书原方争县等。下象国到满工节节商程时运前究。干产公长层将易最各构到知。技然海车究反想它统拉面流器。己术儿入保最离能八想近加且分流。状识元步该转却不建些果表油少技决色战。品党龙效管角可知队己该满两花收把。',
            default: false,
            id: 1,
            childrenNum: 2,
        }
    ],
    collectList: [
        {
            id: 15,
            title: '问完',
            author: '刘勇',
            avatar: 'https://randomuser.me/api/portraits/men/26.jpg',
            detail: '质消被易而满美名选定响性形发长部。酸平果增热几非候组任织家书确公引安。开起构化王名听己所放置命种消积品。查科文进当相步米干准广织强月派在把制。被间少住放铁这斗商便采决问路今出连。世状值所信不民长命了非根前于步它象。解完家公合便南写到以属毛什从较思。什取革做石样快作划深代决存不月格质原。农节决根得活当元志五当无商何精干行。马县月光持提传观同算面样验工支心。术正层能公走织把农劳分边。进程美器照战拉局最每备识金传值百。图第原西广很十思段前海六必派走克。元实调作压打布分合复级等干身队。海团江放心素领候给二列场角。具增美族该今专温他生五们件开连往。片十确从级到具色消开国常果事龙反花。理华认由者府有再些手性委场展。处气制地龙取织省太律内消数必她个。义面四就角候一金结省程正。调安车区通是专包别先争厂然她快。治建个况反用布始什性历收历金群。何地线听走着前造飞方并不候种。声入年变持记示利工之是才法。门情思保较地就叫什商通能气难话间。格眼重活又很政然例准五心任角位。相方根向列例正二住研住委龙。名国公队边体被律则气立达都和回克集。单委如动知手和值积并白难实。指听造无响情江队农正长由去。百备西是广民感价有理属达议样府认日。阶快电走对身领各造论持准管技要。战和北风须民反除数更节样们发得不。公己律门量外五出半积照风周达二二整。连人院军说条提百经家色角快见。例必见万得看心验省方无示。低世飞样做马市验便部题商么际形。织它打应放阶华间十达保任造六过。交体何又话动都立下圆张江和且传。构时米利面共想共联通团每设劳才真政。后由族究十为线际验在国全应亲。越那队地位族各便相交老基。两拉设路先确决美又重组非种委引。月往空九听她本极极学又高好。及用立原想其时定立按也权社力人三三有。料高养低验层土面天商须干光构。思此别整类强节直局道广太。响派统整山队算况效力院去书阶记第着。三号相系及八劳地众当改物段社节有总。会按受劳一照节走下进其值研白十。家求家委术利率南形书装好干何低广备近。与局养需候质里对常声为提山气采。水同件团而五思想些林活产。无精各状我具着节期表准值委解。理任命日查构什取油民社委平热。做每解构火确队方严时究式质极西。子除组个都果片样强论验专离非关。的强改儿联老之研前部行先马却质亲海。就白新争表候和张律那机达。那取管应六和南党阶太层交法记而率任。龙规安存断解知京展群即路利。听元北群果安今计图统南今亲按。组却共成任通片响果起变们从备往常效平。者计发度集院向术常上片边导光。适重入治出没技六正看律快。斗角件任感心信须体商速组般使花。上重交果立它白思阶报持常具风。动矿目己明行矿级资织向照里。住马团值价强传任红战县气越些调。按花数工光公易和小连术干段步起术再。装八查以率状以位象半重维状山命将展。低结回保系五百们斗月且术而业造门。由万有平图能际压米门学积备求国基。物党低以由温单电给点况华真各眼。器看事示之受老格具了示何标。千几广火法日新备成经料复音更。法条安构决细活展太分近海点。较风火她构格院土权集最名产把入。元统管打市间快先没即统里太。一于议统算始青又成单些经争元本。出石示接定步集花养酸习国等生。且政方表直维断员属压把公路包业后。七界约她多二日再前交育方养。片她五识这称于其学示究听准着。府证青走发如最车已治现飞局到来。万证果白些金精程影任至接化电。它红布则但七统院从各织志报图以质。七张近义府果单细米还社品利满命。采地许想究周张算确应层社。形本只团单出压事深华色红大。参存克国分出求步听动六开济亲适快山。局器以严每属位心传据下立外只层。资何许片路得其政米通近将对。业行况角石所产专交选现低。做装斯易少得金强严许车增定年放两科。较它飞该委活东名才务与广照作构。调过育广斯老广至动活转厂海。就变他北起积海青八用身引声性多。按派律龙广通解象平原多手而节常。下深经根复油不它约实前争例。图验济育面会采公量组建走求以什张于。省难容里内王始发手段速圆得到计。最还青她子争过者变口式广米建指头。信热机花算转切省革员气水长题。京始流规委政色油备利太族共说院准本南。色相感万而近主条都给年西。度四道次设日置时东世酸理老什管五。可标名具委没三知至便北利家织局行。研社照包生百你近精状治军张铁。规元研越保完存最火手目此内制场算。必接音价基花声色专它别至或。清完海单单着们具器增易低型联市议特难。收书战直保证根识日火美列包观育它代。过形效经按属参白形住五任电他正。手们历边后采么国际总至由低感可切。史然集气集马地王保能农况包西题步。派流流了事原问持回任民当铁只县任支。酸主却小情情条美平放指越六。还适龙她即况养作想先内达构。最调非线证划争每物响打候象料月认消。人物量天五者节东口角规府完研提格往国。问风及半须济增叫所马连县头除度在相。政来办金称近意资高和叫响阶这也。平需们术个再西计是立准细名装利说正书。后干认造增主走论西生算入没此教。风万老与系由写广一天省证北状。具质但千向并细维其只包受重。党展务才下把政革族离参里看号值会何。委目报毛精价每型发目地七约做。转例到把火内改六难认员经听她。流照育取现计以天查派教斗张。集江斯队红进观酸达路列导圆。标目么员算飞都市构但年张八算值断后。况心委单两深从组广之己上院精非只位。专风变金斯一眼问立接形等信那书打务每。明往造场成这着认民情加她建。放上素子性号持规响志实领备变才周。声记热手结约次平教化厂据相。见很究资五者书生亲为志自。热层对术必常前数问成划又。实联权步几南平身整色道给省。走造结根七效造规建群包西圆你构山例。亲效公进个亲候况通安复史直题八局听划。性经族酸开张行且百头但我省。二确装少小们火断理复产容气约求更。何现于族公开毛积高效步家。主列矿转再严计有矿题要率则花经。究运联两同指江族府快保严称。十片金公过道从示包系构路毛引。院中对细又统观各美即质共期商目压山自。样心设构团工员识号验造己度山质产民。山向本思习众气后还用志使家你计。律容机易全真出建装关许报受。那明别政积情数种军物造学直矿合回头。类满通毛律反格线全整交水之格路务划。积约主八经组当热给需接龙系期。权省山发更院满都国图划还定先每步它着。世影厂际圆理断近究名便能行白民线结。真老写会料年历县定听府千石际级把。般可满为该型青基走领学须况现大他难。管月度素那酸存铁年步任边导。外取斯置花深据因增建领办片眼。华处子利阶有专体该人团根写政。查飞质验结是海回一养本方更中。每带清直列子合毛称器技斗南温学。话之议们型周日给观员院林样而元。格听龙出报主共被白风府低作京你队。',
            cover: 'https://randomuser.me/api/portraits/men/63.jpg',
            collectType: 1,
            favour: 76,
            comment: 91,
            parentId: [1],
        },
        {
            id: 11,
            title: '问完',
            author: '刘勇2',
            avatar: 'https://randomuser.me/api/portraits/men/26.jpg',
            detail: '质消被易而满美名选定响性形发长部。酸平果增热几非候组任织家书确公引安。开起构化王名听己所放置命种消积品。查科文进当相步米干准广织强月派在把制。被间少住放铁这斗商便采决问路今出连。世状值所信不民长命了非根前于步它象。解完家公合便南写到以属毛什从较思。什取革做石样快作划深代决存不月格质原。农节决根得活当元志五当无商何精干行。马县月光持提传观同算面样验工支心。术正层能公走织把农劳分边。进程美器照战拉局最每备识金传值百。图第原西广很十思段前海六必派走克。元实调作压打布分合复级等干身队。海团江放心素领候给二列场角。具增美族该今专温他生五们件开连往。片十确从级到具色消开国常果事龙反花。理华认由者府有再些手性委场展。处气制地龙取织省太律内消数必她个。义面四就角候一金结省程正。调安车区通是专包别先争厂然她快。治建个况反用布始什性历收历金群。何地线听走着前造飞方并不候种。声入年变持记示利工之是才法。门情思保较地就叫什商通能气难话间。格眼重活又很政然例准五心任角位。相方根向列例正二住研住委龙。名国公队边体被律则气立达都和回克集。单委如动知手和值积并白难实。指听造无响情江队农正长由去。百备西是广民感价有理属达议样府认日。阶快电走对身领各造论持准管技要。战和北风须民反除数更节样们发得不。公己律门量外五出半积照风周达二二整。连人院军说条提百经家色角快见。例必见万得看心验省方无示。低世飞样做马市验便部题商么际形。织它打应放阶华间十达保任造六过。交体何又话动都立下圆张江和且传。构时米利面共想共联通团每设劳才真政。后由族究十为线际验在国全应亲。越那队地位族各便相交老基。两拉设路先确决美又重组非种委引。月往空九听她本极极学又高好。及用立原想其时定立按也权社力人三三有。料高养低验层土面天商须干光构。思此别整类强节直局道广太。响派统整山队算况效力院去书阶记第着。三号相系及八劳地众当改物段社节有总。会按受劳一照节走下进其值研白十。家求家委术利率南形书装好干何低广备近。与局养需候质里对常声为提山气采。水同件团而五思想些林活产。无精各状我具着节期表准值委解。理任命日查构什取油民社委平热。做每解构火确队方严时究式质极西。子除组个都果片样强论验专离非关。的强改儿联老之研前部行先马却质亲海。就白新争表候和张律那机达。那取管应六和南党阶太层交法记而率任。龙规安存断解知京展群即路利。听元北群果安今计图统南今亲按。组却共成任通片响果起变们从备往常效平。者计发度集院向术常上片边导光。适重入治出没技六正看律快。斗角件任感心信须体商速组般使花。上重交果立它白思阶报持常具风。动矿目己明行矿级资织向照里。住马团值价强传任红战县气越些调。按花数工光公易和小连术干段步起术再。装八查以率状以位象半重维状山命将展。低结回保系五百们斗月且术而业造门。由万有平图能际压米门学积备求国基。物党低以由温单电给点况华真各眼。器看事示之受老格具了示何标。千几广火法日新备成经料复音更。法条安构决细活展太分近海点。较风火她构格院土权集最名产把入。元统管打市间快先没即统里太。一于议统算始青又成单些经争元本。出石示接定步集花养酸习国等生。且政方表直维断员属压把公路包业后。七界约她多二日再前交育方养。片她五识这称于其学示究听准着。府证青走发如最车已治现飞局到来。万证果白些金精程影任至接化电。它红布则但七统院从各织志报图以质。七张近义府果单细米还社品利满命。采地许想究周张算确应层社。形本只团单出压事深华色红大。参存克国分出求步听动六开济亲适快山。局器以严每属位心传据下立外只层。资何许片路得其政米通近将对。业行况角石所产专交选现低。做装斯易少得金强严许车增定年放两科。较它飞该委活东名才务与广照作构。调过育广斯老广至动活转厂海。就变他北起积海青八用身引声性多。按派律龙广通解象平原多手而节常。下深经根复油不它约实前争例。图验济育面会采公量组建走求以什张于。省难容里内王始发手段速圆得到计。最还青她子争过者变口式广米建指头。信热机花算转切省革员气水长题。京始流规委政色油备利太族共说院准本南。色相感万而近主条都给年西。度四道次设日置时东世酸理老什管五。可标名具委没三知至便北利家织局行。研社照包生百你近精状治军张铁。规元研越保完存最火手目此内制场算。必接音价基花声色专它别至或。清完海单单着们具器增易低型联市议特难。收书战直保证根识日火美列包观育它代。过形效经按属参白形住五任电他正。手们历边后采么国际总至由低感可切。史然集气集马地王保能农况包西题步。派流流了事原问持回任民当铁只县任支。酸主却小情情条美平放指越六。还适龙她即况养作想先内达构。最调非线证划争每物响打候象料月认消。人物量天五者节东口角规府完研提格往国。问风及半须济增叫所马连县头除度在相。政来办金称近意资高和叫响阶这也。平需们术个再西计是立准细名装利说正书。后干认造增主走论西生算入没此教。风万老与系由写广一天省证北状。具质但千向并细维其只包受重。党展务才下把政革族离参里看号值会何。委目报毛精价每型发目地七约做。转例到把火内改六难认员经听她。流照育取现计以天查派教斗张。集江斯队红进观酸达路列导圆。标目么员算飞都市构但年张八算值断后。况心委单两深从组广之己上院精非只位。专风变金斯一眼问立接形等信那书打务每。明往造场成这着认民情加她建。放上素子性号持规响志实领备变才周。声记热手结约次平教化厂据相。见很究资五者书生亲为志自。热层对术必常前数问成划又。实联权步几南平身整色道给省。走造结根七效造规建群包西圆你构山例。亲效公进个亲候况通安复史直题八局听划。性经族酸开张行且百头但我省。二确装少小们火断理复产容气约求更。何现于族公开毛积高效步家。主列矿转再严计有矿题要率则花经。究运联两同指江族府快保严称。十片金公过道从示包系构路毛引。院中对细又统观各美即质共期商目压山自。样心设构团工员识号验造己度山质产民。山向本思习众气后还用志使家你计。律容机易全真出建装关许报受。那明别政积情数种军物造学直矿合回头。类满通毛律反格线全整交水之格路务划。积约主八经组当热给需接龙系期。权省山发更院满都国图划还定先每步它着。世影厂际圆理断近究名便能行白民线结。真老写会料年历县定听府千石际级把。般可满为该型青基走领学须况现大他难。管月度素那酸存铁年步任边导。外取斯置花深据因增建领办片眼。华处子利阶有专体该人团根写政。查飞质验结是海回一养本方更中。每带清直列子合毛称器技斗南温学。话之议们型周日给观员院林样而元。格听龙出报主共被白风府低作京你队。',
            cover: 'https://randomuser.me/api/portraits/men/63.jpg',
            collectType: 1,
            favour: 76,
            comment: 91,
            parentId: [1, 2],
        },
    ],
})

const bookShare = ref();
const onShare = () => {
    bookShare.value?.showShare();
}

const updateItem = (
    sonData = { checked: [], curItem: {} }
) => {
    const { checked, curItem } = sonData
    //当前item在collectList中的索引
    const curSonIndex = list.value.collectList.findIndex(
        (item) => item.id === curItem.id
    )
    checked.forEach((val, index) => {
        const bookmarkId = list.value.bookmarkList[index].id
        if (val === true && !curItem.parentId.includes(bookmarkId)) {
            curItem.parentId.push(bookmarkId)
            list.value.bookmarkList[index].childrenNum += 1
        }
        if (val === false && curItem.parentId.includes(bookmarkId)) {
            //当前书签文件夹id在collectList的item中的parentId的索引
            const parentIdIndex = curItem.parentId.findIndex(
                (item) => item === bookmarkId
            )
            curItem.parentId.splice(parentIdIndex, 1)
            curItem.parentId.length === 0 &&
                list.value.collectList.splice(curSonIndex, 1)
            list.value.bookmarkList[index].childrenNum -= 1
            list.value.allNum -= 1
        }
    })
}

//显示新建/编辑收藏夹弹框
const addEditRef = ref('add') //create/edit
const bookmarkItemIndex = ref(-1)
const isShowCreate = ref(false)
const lastBookmarkId = ref(null);
watch(() => list.value.bookmarkList, () => {
    lastBookmarkId.value = list.value.bookmarkList[list.value.bookmarkList.length - 1].id
}, {
    immediate: true,
    deep: true
})
const bookmarkItemObj = ref({})
const showBookmark = (type = 'add', params = {}, index = -1) => {
    if (type === 'edit') {
        bookmarkItemObj.value = params
        bookmarkItemIndex.value = index
    } else {
        bookmarkItemObj.value = {}
    }
    addEditRef.value = type
    isShowCreate.value = true
}
provide('showBookmark', showBookmark)
const closeBookmarkPopup = () => {
    isShowCreate.value = false
}
//更新收藏夹
const updateBookmark = (data) => {
    if (data.default === true) {
        list.value.bookmarkList.every(item => {
            (item.id !== data.id) && (item.default = false);
        })
    }
    addEditRef.value === 'add'
        ? list.value.bookmarkList.push({ ...data })
        : (list.value.bookmarkList[bookmarkItemIndex.value] =
            data)
    closeBookmarkPopup()
}
</script>
<style scoped lang='scss'>
.collect-page-top {
    background: rgba(0, 0, 0, .3);
    height: 100px;
    padding: 7px 9px;
    display: flex;
    flex-direction: column;
    justify-content: space-between;
    color: #fff;
}

.collect-page-main {
    .explain {
        padding: 7px 9px;
    }
}
</style>
