<template>
    <div class="collect-page">
        <van-row justify="space-between" align="center">
            <van-col>
                <van-tabs v-model:active="active">
                    <van-tab title="我收藏的"></van-tab>
                    <van-tab title="我关注的"></van-tab>
                </van-tabs>
            </van-col>
            <van-col @click="showBookmark('add')">新建收藏夹</van-col>
        </van-row>
        <van-row justify="space-between" class="explain">
            <van-col>
                <span v-show="orderType === 0">{{ list.allNum }}条内容</span>
                <span v-show="orderType === 1">{{ list.bookmarkList.length }}个文件夹</span>
            </van-col>
            <van-col @click="onToggleOrderType">
                <span v-show="orderType === 0">
                    <van-icon name="peer-pay" />按收藏夹
                </span>
                <span v-show="orderType === 1">
                    <van-icon name="orders-o" />按内容
                </span>
            </van-col>
        </van-row>
        <template v-if="orderType === 0">
            <CollectItem @share="onShare" v-for="(item, index) in list.collectList" :key="item.id" :item="item"
                :index="index" :parentId="item.parentId" :bookmarkList="list.bookmarkList"
                @update="updateBookmark($event)" />
        </template>
        <BookmarkItem v-show="orderType === 1" v-for="(item, index) in list.bookmarkList" :key="(item, index).id"
            :item="item" @edit="showBookmark('edit', $event, index)" />
        <p class="tips gray-font">没有更多内容</p>
        <BookShare ref="bookShare" :data="{ item: bookShareData, hideIcon: true }" />

        <!-- 新建文件夹 弹框 -->
        <van-popup closeable close-icon="close" close-icon-position="top-left" v-model:show="isShowCreate" round
            position="bottom" :style="{ height: '90%', padding: '20px 10px' }">
            <h3 class="text-c position-r">
                新建收藏夹
                <span class="position-a btn-submit" @click="createEditBookmark">{{ addEditRef === 'add' ? '创建' : '完成'
                    }}</span>
            </h3>
            <van-cell-group inset>
                <van-field v-model="bookmarkItemRef.folderTitle" name="folderTitle" label="" placeholder="添加收藏夹标题"
                    :rules="[
                        {
                            validator: validator.folderTitle,
                            message: '请输入长度不超过20的标题',
                        },
                    ]" />
                <van-field v-model="bookmarkItemRef.depict" name="depict" label="" placeholder="添加收藏夹描述(可选)" :rules="[
                    {
                        validator: validator.depict,
                        message: '请输入长度不超过300的描述',
                    },
                ]" />
                <van-field name="radio" label="">
                    <template #input>
                        <van-radio-group v-model="bookmarkItemRef.power" direction="horizontal">
                            <van-radio :name="1">仅自己可见</van-radio>
                            <br />
                            <van-radio :name="2">公开</van-radio>
                        </van-radio-group>
                    </template>
                </van-field>
                <p v-show="bookmarkItemRef.power === 2" class="gray-font power-tips">
                    公开的收藏夹在站内可以流通，其他人可以关注你的收藏夹。改收藏夹未来有关注者后，将无法设为私密。
                </p>
                <van-button plain round type="default" @click="setDefault" size="mini"
                    class="btn-set-default">设为默认收藏夹</van-button>
            </van-cell-group>
        </van-popup>
    </div>
</template>
<script setup>
import { provide, ref } from 'vue'
import CollectItem from './CollectItem.vue'
import BookShare from '@/components/BookShare/Index.vue'
import BookmarkItem from './BookmarkItem.vue'
import { fetchCollectList } from '@/api/recent.js'
//收藏夹列表
const list = ref({
    allNum: 4,
    bookmarkList: [
        {
            folderTitle: '口构采律表强米出',
            power: 1,
            depict: '建这行期往对响素风五美精八半层体。完革并准万飞志严成得省区由到置据按。口易军计身点决思取色政决气联。提住物面商关带也称路她但物权。火入根得展气局片温研队高而安。结场天素传维量作三同工中酸二认专直。法院选它别以但作长从进拉律因度积复很。叫队信真问始万音号当器适己。指照己属入应作器对出料马着速价。飞是京以没拉那算代名备风务周带十保。求或极社取矿角地交七来记。元便次会一种候得习加上张领。建专类通参类用化在看面族中交新米问。划属列何么道长记厂家再指生看农家计。难亲满史强正该支无图认处农门细。更等周可置万矿部个总即事好快命。装所色动历众队高科广价定张总其示派。温活设们石通阶使压金知须千严适。更工你小品清素者速风般王系理正装。技信毛在铁过众建平最设何几。群山许采取重电离方便连划。变感速在结温系周还组强动设受离华名。提将圆算集料部作照走价些了周江家。价住务平路具代头九通组称义。资者话报斯权无代照期林清且事方周好。报最易离验对就书取感候难通。当认南劳却体写要回断风步队。七连经段先然好史有质求标具海加月们料。马交段备交结响看性县论她知毛。式代公际里府系主织几至二。保山容世采开七别向除计家议角准于。素不研节内团酸应声四众我历段务计次。它图红称手精名置般应准严全半级。到理常万还立江收据求关定当造常。细条世性角目资各支风示合认采。运两总保海列里般使现政农去目快。反些他政指程安建山队日集。金第区难得常受始料老科教正己。局关写口文论今反率利圆场带我飞系。什知强度边达等实门给会价对感加。样知争适由特见选机清参起一容表万气音。小数动来水事空自族金习约。准了六行行重指统还片状对决东。各候或关状处政例形律按广常切。法标图都太发基响住斯白北较。头上名方美往各接最度象由团加经即委。平数手百气半口确调社会强。议活土总队动东专百马而水计什转。图小现量路重南又今须越深。存京领活条技工办近般门长线证。而水起品斯斗文队过强么信织较据见七。本须说相每始严线生点性器利。在斗据来件年会研特压须斗得电色经会。义见文认事相变化王容了状化相。住原反教无就场想史外再知例。阶解面传准为路少行形物质名南较。八点育队二东计查快二可子查。学理查书般育此今技响效层米然五理速。文算取整新保六图影没六整领好装她断。各议选能自全快积市般值速气则较构。局再红眼志型形起须或流土极目文。影装候时影要知领空行眼车向越观业样间。自并增天什入分都金高机转确称报点。个世等规几基利斗自转传位多。相又出断开况基性带体采级求。心组细反治法基路子之积八学号。音同平第品色支养他少她照子厂治后。问十专林王八计又类认片规眼治。设将两先高政们电委明意得力米空空器前。角后走比利太花系受物业细报界身原。光开义己业业龙又华派都类规。每由动作证则类其口称高则划术文我合。体各经织只社内标近明子响农备后信广表。装约变基更合内火方带众存现安。系马入存化己经所不门价完先被。许效统石格近年受认同由了月样况。群社则日点领话研车你除自社半心资叫形。百织验斯子手广同高里阶白只表统。金两入亲取今程干义主感力着必院百。置适单团导段维身领统容一复约算。组就斗西收只集得在可安八机子他发。来关打回流原厂养理头包品先备统。整化式克青进持新京飞原头积委所市不王。种引都号度写老产识土种改光油压后区。果议最五究经比心通则究转电。效矿论原数府色书干手江直江有用同主月。根界叫质来院儿通工打质行南革。状九由很山住技布备了府低来间议地然。革立变走养果许理始广角名想。育利应放六子段近从利五响立心。而毛习情农发院采年种本备三。关农万水东照清使上性美我算斯争再己。人向应完圆别始力严期走他连通头。具总须习文加料县建适写个华了或张完。所计求每些院理列无系已并。号克按素安而期积酸选被七五调易写团。里听及同铁和造者来流公界此件要条。具导石西力拉铁起内于五情属平统矿己。作满许给听感连发车合改入快事收军县。条持油门五商共天流南今此住又。意习石论行风发南权应动效定。这火称利约却作时真光器思及。深适具或分接期养快六习马实加较色。支按边报话它要报除满当维什他北。办群认调张能大展万许用组。点层权了个活验周斯学政义强采第农。条广认油太细以备根六之色记。厂面义际统属们书满期能造容儿正程备。运响龙写市细研门保白向音他它。系青白方史则相记眼议由还十色。算电满料查很亲领风矿小细民。直西领器原都器权看想报知达们政因易。些果战只受厂元清备用包了场价习。油化道候动如放难积界今下当即建眼员。领气周格次铁阶达马书原方争县等。下象国到满工节节商程时运前究。干产公长层将易最各构到知。技然海车究反想它统拉面流器。己术儿入保最离能八想近加且分流。状识元步该转却不建些果表油少技决色战。品党龙效管角可知队己该满两花收把。',
            default: false,
            id: 1,
            childrenNum: 2,
        },
        {
            folderTitle: '土太准文具适建都原',
            power: 1,
            depict: '置器几果快格中属条美以党为由主根。色离响选该音去报广有儿但权律专置。产认整行但产华法外持自说以象。效其省率身行际应而都门统家自音。据改法住候种阶天列布料问。低眼打向快那林况示们值说。东府义无家战料认才响如证者。明易得形器全关共易质知变布天。科于流斯价自消参关京下于米发设政去族。性走打法利于起属证准放易。家布矿圆调关务厂农音性关。标党包识二且后成事规几据记合支律。象不自完就但土单风命速志史体回变。两许少节候车过反适公公外示马利比。矿例作美府无石片步林子整理音是思。器准因点张增出切能十革已规维候。完族酸义便他效数才图观明况革相速要导。也相万听原毛上每年须思满何包事具。统天是论处步题片期给书毛。常特据转成资主色划次发达并己看两。料二称接展三设强王何热完关。张建志写天元持适然速构它常。面术金美省县变素老以热党色花无温条。拉际小见去就全传完厂置数几。长划界温一众生间院委产便展调管。结己公着越应总族从着指三。化意意想下统感公备目青据研增适战。才县天平细素与看五关六压国观。自建做军要计条王引清与办研识。不期效家分段天它验接在部术或公。收社取必电高取应天六照变然。接具此称来器路阶放统类力或们没。理革较当儿与划义格么政民装养业。除头利号各住团十件好心关达。消国持界金三节直那调明书都济政百。关区反劳地温准看传些且他统。两样种联且重二龙调率解命包油。新才问集油调气石院北重产。不厂料天名们从少部号示红总办。制而计者者产然育又究级高上自连。民称青任少林速只感什省动复导。新论她心改越称过放条包办电类专家方。用红厂则作上厂数方太老省对。动动立便律自价号期识点办她。提持但文得前区期己线住系无子成律。存计到精地同法手住验本价共具样山易。离国见条商引二还电角府记表准八三备。半但保问图便干科而报小农时少第算观。全别证国空论商流目安收美领。采学影历受接员外十求断亲。变明化问片任层值八连处际却风华张机。写复温包府专分属拉上布争做。交身造走导许化与农因包再得也火。处标美严正回程严根口必切五华。何机数程取严它选在加声取维水着多。变置车即团感此装确速角如代。认派比上称意政观数支说及明存解而。体提名这元量加局当图查党该代月知收。众习走得北县难完产作重个器区技。要团期传东表处铁要都内决其东者主。正来约列法着业统向包安参一气快。段万律务进类员只争联心容三市道非。加联务己无市转主能规阶有个省间品算。干步例界物表造月效原型劳据气备院收细。或任北厂调许劳集连南该论包。前候受十交解写意便并集包断流农当下。带到结准使一非统内队目引当点影战。叫关有马行千称转别极界却也书效为带管。就式求并八那一复色身又下平小务种。儿带信办一最厂转每酸政气应。争第它布化分铁如温月眼三空。气火参质五中义口重众十好个运。没习法单常安所头格太数看口引农为。史值很政因它把回又类具土质选下你。再才示联声教特就实转劳许县被体术备。叫因到儿把与适切料才学清即省干各需象。片义战量等年周持们和党南代美收区青。我何严时车斯放再高斯音记称这。局道时参权产高布门作特管劳车该林部说。王记压厂则此米争装眼影该部位特示特区。机到将日对际根是进农拉权被转然。持相着京员群转青机值结王为设根。完当身院工必展容定没火电现研。界题号义件回系派叫算行争比上上收公书。且就生象价难眼地路部须立南西将几。打计必些定术有政包工话转三完回观研。格品步强文际花西口什支治身间本候。各量京各象影段已才千适该如也治斗亲。权引展应个再也记世县义展改强志。火该边存亲据半二各最金反头却存便。口什等求记给上连然报离三两电路学土。年应际象人老层结长每受及。天育准矿题表持准今主程商料真学写。总无江主满压我回准行志想成记重较。油并化存目低把响于走花机七老速。物少界交话事只元极众五体响事。地者构色引比水日济无矿毛毛听起发在者。手心研部为习周比后构红空放历。儿文先给员长车空科科被众议现。压命收老程华月电期细公难。结只华保参数图达身到素世入论会无。有将置花压有是积斗到断决拉业。条无引里节验六压标验须老步。收周段没对但样处验口并往名断。后场百况石就低定进七明统广段亲用。斯层级头五需料难员九性军率与形。具战委主当米布土张听说素满。命根族史日工争即把道己都就。角何国米青力儿现入导标明红都命除际。应律料价调机声安局照张难。见思应表东并常直观种直心关造了机。个持战导日眼界她需她知事热美。参查须四求传工管儿般去眼单养文圆是。交社我世计级增正传月存装别。光太政完无统件科元中眼明次。能格转速受已数党常等管省般用根十可即。东量产革型一看加图上料件由式之知。素快军并江主世连支分划复列你车认选属。化而系流每院产布形开十王且现马。在情农带以省明务根民型根论。出新受机场离线中应解次应放许话手合。般在压五斗带想阶院受格保全写四。系政中计战六种作号实有加步油二各将。八儿经经边目当感运后界度极心与动。没解矿战百但达里表见月基。计外治领连片将员立置样时效道声从。千济说习百文方状程已北公处党指。期技区结图转阶图之角元具口。',
            default: false,
            id: 2,
            childrenNum: 2,
        },
    ],
    collectList: [
        {
            id: 15,
            title: '问完',
            author: '刘勇',
            avatar: 'https://randomuser.me/api/portraits/men/26.jpg',
            detail: '质消被易而满美名选定响性形发长部。酸平果增热几非候组任织家书确公引安。开起构化王名听己所放置命种消积品。查科文进当相步米干准广织强月派在把制。被间少住放铁这斗商便采决问路今出连。世状值所信不民长命了非根前于步它象。解完家公合便南写到以属毛什从较思。什取革做石样快作划深代决存不月格质原。农节决根得活当元志五当无商何精干行。马县月光持提传观同算面样验工支心。术正层能公走织把农劳分边。进程美器照战拉局最每备识金传值百。图第原西广很十思段前海六必派走克。元实调作压打布分合复级等干身队。海团江放心素领候给二列场角。具增美族该今专温他生五们件开连往。片十确从级到具色消开国常果事龙反花。理华认由者府有再些手性委场展。处气制地龙取织省太律内消数必她个。义面四就角候一金结省程正。调安车区通是专包别先争厂然她快。治建个况反用布始什性历收历金群。何地线听走着前造飞方并不候种。声入年变持记示利工之是才法。门情思保较地就叫什商通能气难话间。格眼重活又很政然例准五心任角位。相方根向列例正二住研住委龙。名国公队边体被律则气立达都和回克集。单委如动知手和值积并白难实。指听造无响情江队农正长由去。百备西是广民感价有理属达议样府认日。阶快电走对身领各造论持准管技要。战和北风须民反除数更节样们发得不。公己律门量外五出半积照风周达二二整。连人院军说条提百经家色角快见。例必见万得看心验省方无示。低世飞样做马市验便部题商么际形。织它打应放阶华间十达保任造六过。交体何又话动都立下圆张江和且传。构时米利面共想共联通团每设劳才真政。后由族究十为线际验在国全应亲。越那队地位族各便相交老基。两拉设路先确决美又重组非种委引。月往空九听她本极极学又高好。及用立原想其时定立按也权社力人三三有。料高养低验层土面天商须干光构。思此别整类强节直局道广太。响派统整山队算况效力院去书阶记第着。三号相系及八劳地众当改物段社节有总。会按受劳一照节走下进其值研白十。家求家委术利率南形书装好干何低广备近。与局养需候质里对常声为提山气采。水同件团而五思想些林活产。无精各状我具着节期表准值委解。理任命日查构什取油民社委平热。做每解构火确队方严时究式质极西。子除组个都果片样强论验专离非关。的强改儿联老之研前部行先马却质亲海。就白新争表候和张律那机达。那取管应六和南党阶太层交法记而率任。龙规安存断解知京展群即路利。听元北群果安今计图统南今亲按。组却共成任通片响果起变们从备往常效平。者计发度集院向术常上片边导光。适重入治出没技六正看律快。斗角件任感心信须体商速组般使花。上重交果立它白思阶报持常具风。动矿目己明行矿级资织向照里。住马团值价强传任红战县气越些调。按花数工光公易和小连术干段步起术再。装八查以率状以位象半重维状山命将展。低结回保系五百们斗月且术而业造门。由万有平图能际压米门学积备求国基。物党低以由温单电给点况华真各眼。器看事示之受老格具了示何标。千几广火法日新备成经料复音更。法条安构决细活展太分近海点。较风火她构格院土权集最名产把入。元统管打市间快先没即统里太。一于议统算始青又成单些经争元本。出石示接定步集花养酸习国等生。且政方表直维断员属压把公路包业后。七界约她多二日再前交育方养。片她五识这称于其学示究听准着。府证青走发如最车已治现飞局到来。万证果白些金精程影任至接化电。它红布则但七统院从各织志报图以质。七张近义府果单细米还社品利满命。采地许想究周张算确应层社。形本只团单出压事深华色红大。参存克国分出求步听动六开济亲适快山。局器以严每属位心传据下立外只层。资何许片路得其政米通近将对。业行况角石所产专交选现低。做装斯易少得金强严许车增定年放两科。较它飞该委活东名才务与广照作构。调过育广斯老广至动活转厂海。就变他北起积海青八用身引声性多。按派律龙广通解象平原多手而节常。下深经根复油不它约实前争例。图验济育面会采公量组建走求以什张于。省难容里内王始发手段速圆得到计。最还青她子争过者变口式广米建指头。信热机花算转切省革员气水长题。京始流规委政色油备利太族共说院准本南。色相感万而近主条都给年西。度四道次设日置时东世酸理老什管五。可标名具委没三知至便北利家织局行。研社照包生百你近精状治军张铁。规元研越保完存最火手目此内制场算。必接音价基花声色专它别至或。清完海单单着们具器增易低型联市议特难。收书战直保证根识日火美列包观育它代。过形效经按属参白形住五任电他正。手们历边后采么国际总至由低感可切。史然集气集马地王保能农况包西题步。派流流了事原问持回任民当铁只县任支。酸主却小情情条美平放指越六。还适龙她即况养作想先内达构。最调非线证划争每物响打候象料月认消。人物量天五者节东口角规府完研提格往国。问风及半须济增叫所马连县头除度在相。政来办金称近意资高和叫响阶这也。平需们术个再西计是立准细名装利说正书。后干认造增主走论西生算入没此教。风万老与系由写广一天省证北状。具质但千向并细维其只包受重。党展务才下把政革族离参里看号值会何。委目报毛精价每型发目地七约做。转例到把火内改六难认员经听她。流照育取现计以天查派教斗张。集江斯队红进观酸达路列导圆。标目么员算飞都市构但年张八算值断后。况心委单两深从组广之己上院精非只位。专风变金斯一眼问立接形等信那书打务每。明往造场成这着认民情加她建。放上素子性号持规响志实领备变才周。声记热手结约次平教化厂据相。见很究资五者书生亲为志自。热层对术必常前数问成划又。实联权步几南平身整色道给省。走造结根七效造规建群包西圆你构山例。亲效公进个亲候况通安复史直题八局听划。性经族酸开张行且百头但我省。二确装少小们火断理复产容气约求更。何现于族公开毛积高效步家。主列矿转再严计有矿题要率则花经。究运联两同指江族府快保严称。十片金公过道从示包系构路毛引。院中对细又统观各美即质共期商目压山自。样心设构团工员识号验造己度山质产民。山向本思习众气后还用志使家你计。律容机易全真出建装关许报受。那明别政积情数种军物造学直矿合回头。类满通毛律反格线全整交水之格路务划。积约主八经组当热给需接龙系期。权省山发更院满都国图划还定先每步它着。世影厂际圆理断近究名便能行白民线结。真老写会料年历县定听府千石际级把。般可满为该型青基走领学须况现大他难。管月度素那酸存铁年步任边导。外取斯置花深据因增建领办片眼。华处子利阶有专体该人团根写政。查飞质验结是海回一养本方更中。每带清直列子合毛称器技斗南温学。话之议们型周日给观员院林样而元。格听龙出报主共被白风府低作京你队。',
            cover: 'https://randomuser.me/api/portraits/men/63.jpg',
            collectType: 1,
            favour: 76,
            comment: 91,
            parentId: [1],
        },
        {
            id: 11,
            title: '问完',
            author: '刘勇2',
            avatar: 'https://randomuser.me/api/portraits/men/26.jpg',
            detail: '质消被易而满美名选定响性形发长部。酸平果增热几非候组任织家书确公引安。开起构化王名听己所放置命种消积品。查科文进当相步米干准广织强月派在把制。被间少住放铁这斗商便采决问路今出连。世状值所信不民长命了非根前于步它象。解完家公合便南写到以属毛什从较思。什取革做石样快作划深代决存不月格质原。农节决根得活当元志五当无商何精干行。马县月光持提传观同算面样验工支心。术正层能公走织把农劳分边。进程美器照战拉局最每备识金传值百。图第原西广很十思段前海六必派走克。元实调作压打布分合复级等干身队。海团江放心素领候给二列场角。具增美族该今专温他生五们件开连往。片十确从级到具色消开国常果事龙反花。理华认由者府有再些手性委场展。处气制地龙取织省太律内消数必她个。义面四就角候一金结省程正。调安车区通是专包别先争厂然她快。治建个况反用布始什性历收历金群。何地线听走着前造飞方并不候种。声入年变持记示利工之是才法。门情思保较地就叫什商通能气难话间。格眼重活又很政然例准五心任角位。相方根向列例正二住研住委龙。名国公队边体被律则气立达都和回克集。单委如动知手和值积并白难实。指听造无响情江队农正长由去。百备西是广民感价有理属达议样府认日。阶快电走对身领各造论持准管技要。战和北风须民反除数更节样们发得不。公己律门量外五出半积照风周达二二整。连人院军说条提百经家色角快见。例必见万得看心验省方无示。低世飞样做马市验便部题商么际形。织它打应放阶华间十达保任造六过。交体何又话动都立下圆张江和且传。构时米利面共想共联通团每设劳才真政。后由族究十为线际验在国全应亲。越那队地位族各便相交老基。两拉设路先确决美又重组非种委引。月往空九听她本极极学又高好。及用立原想其时定立按也权社力人三三有。料高养低验层土面天商须干光构。思此别整类强节直局道广太。响派统整山队算况效力院去书阶记第着。三号相系及八劳地众当改物段社节有总。会按受劳一照节走下进其值研白十。家求家委术利率南形书装好干何低广备近。与局养需候质里对常声为提山气采。水同件团而五思想些林活产。无精各状我具着节期表准值委解。理任命日查构什取油民社委平热。做每解构火确队方严时究式质极西。子除组个都果片样强论验专离非关。的强改儿联老之研前部行先马却质亲海。就白新争表候和张律那机达。那取管应六和南党阶太层交法记而率任。龙规安存断解知京展群即路利。听元北群果安今计图统南今亲按。组却共成任通片响果起变们从备往常效平。者计发度集院向术常上片边导光。适重入治出没技六正看律快。斗角件任感心信须体商速组般使花。上重交果立它白思阶报持常具风。动矿目己明行矿级资织向照里。住马团值价强传任红战县气越些调。按花数工光公易和小连术干段步起术再。装八查以率状以位象半重维状山命将展。低结回保系五百们斗月且术而业造门。由万有平图能际压米门学积备求国基。物党低以由温单电给点况华真各眼。器看事示之受老格具了示何标。千几广火法日新备成经料复音更。法条安构决细活展太分近海点。较风火她构格院土权集最名产把入。元统管打市间快先没即统里太。一于议统算始青又成单些经争元本。出石示接定步集花养酸习国等生。且政方表直维断员属压把公路包业后。七界约她多二日再前交育方养。片她五识这称于其学示究听准着。府证青走发如最车已治现飞局到来。万证果白些金精程影任至接化电。它红布则但七统院从各织志报图以质。七张近义府果单细米还社品利满命。采地许想究周张算确应层社。形本只团单出压事深华色红大。参存克国分出求步听动六开济亲适快山。局器以严每属位心传据下立外只层。资何许片路得其政米通近将对。业行况角石所产专交选现低。做装斯易少得金强严许车增定年放两科。较它飞该委活东名才务与广照作构。调过育广斯老广至动活转厂海。就变他北起积海青八用身引声性多。按派律龙广通解象平原多手而节常。下深经根复油不它约实前争例。图验济育面会采公量组建走求以什张于。省难容里内王始发手段速圆得到计。最还青她子争过者变口式广米建指头。信热机花算转切省革员气水长题。京始流规委政色油备利太族共说院准本南。色相感万而近主条都给年西。度四道次设日置时东世酸理老什管五。可标名具委没三知至便北利家织局行。研社照包生百你近精状治军张铁。规元研越保完存最火手目此内制场算。必接音价基花声色专它别至或。清完海单单着们具器增易低型联市议特难。收书战直保证根识日火美列包观育它代。过形效经按属参白形住五任电他正。手们历边后采么国际总至由低感可切。史然集气集马地王保能农况包西题步。派流流了事原问持回任民当铁只县任支。酸主却小情情条美平放指越六。还适龙她即况养作想先内达构。最调非线证划争每物响打候象料月认消。人物量天五者节东口角规府完研提格往国。问风及半须济增叫所马连县头除度在相。政来办金称近意资高和叫响阶这也。平需们术个再西计是立准细名装利说正书。后干认造增主走论西生算入没此教。风万老与系由写广一天省证北状。具质但千向并细维其只包受重。党展务才下把政革族离参里看号值会何。委目报毛精价每型发目地七约做。转例到把火内改六难认员经听她。流照育取现计以天查派教斗张。集江斯队红进观酸达路列导圆。标目么员算飞都市构但年张八算值断后。况心委单两深从组广之己上院精非只位。专风变金斯一眼问立接形等信那书打务每。明往造场成这着认民情加她建。放上素子性号持规响志实领备变才周。声记热手结约次平教化厂据相。见很究资五者书生亲为志自。热层对术必常前数问成划又。实联权步几南平身整色道给省。走造结根七效造规建群包西圆你构山例。亲效公进个亲候况通安复史直题八局听划。性经族酸开张行且百头但我省。二确装少小们火断理复产容气约求更。何现于族公开毛积高效步家。主列矿转再严计有矿题要率则花经。究运联两同指江族府快保严称。十片金公过道从示包系构路毛引。院中对细又统观各美即质共期商目压山自。样心设构团工员识号验造己度山质产民。山向本思习众气后还用志使家你计。律容机易全真出建装关许报受。那明别政积情数种军物造学直矿合回头。类满通毛律反格线全整交水之格路务划。积约主八经组当热给需接龙系期。权省山发更院满都国图划还定先每步它着。世影厂际圆理断近究名便能行白民线结。真老写会料年历县定听府千石际级把。般可满为该型青基走领学须况现大他难。管月度素那酸存铁年步任边导。外取斯置花深据因增建领办片眼。华处子利阶有专体该人团根写政。查飞质验结是海回一养本方更中。每带清直列子合毛称器技斗南温学。话之议们型周日给观员院林样而元。格听龙出报主共被白风府低作京你队。',
            cover: 'https://randomuser.me/api/portraits/men/63.jpg',
            collectType: 1,
            favour: 76,
            comment: 91,
            parentId: [1, 2],
        },
        {
            id: 17,
            title: '根自道织',
            author: '易超',
            avatar: 'https://randomuser.me/api/portraits/men/5.jpg',
            detail: '第元样院车须布积量共使图共得天面气。县南志们资本子经值段光它建能。七况器音思元写表安再种多经收压始件。率北象山部同听九叫层提成其报导以候。油记都快道如想业北养治车。而温党日党农老没得东却划委。争保将已运深资查属造转称五权。小重院出实月对见高王斗党能可受也成。光增龙细院制名声往与离西队心易适行府。般记值最单接当还人个府听节。声少科对上划展领响经会学体走受保有按。消业为活设集海利意持连实计东程具天。此出感由六信空门断万导直走书效近。过技省而统之界区中观车存三造表。命收目专义布求人见则不集段验次。局争进统部近列取区做速这。代级者运毛重平情龙四其制白养利。身大得传样将入音法或增什议社层报。型同七后电于集较收于想队族前明料。共极务正集复想经毛育要资信照厂。段建长次发并着最细次号县采子最高况。快四压也在南何及验他多三了。状同开专问是儿见然方前许断自精到。想的王内完油技管得更信争长广必导收。走问前品展边却今题动主发技设万快。离目相织位复门通感公再计亲省美世。风级量张变阶点路表办片拉动去龙。增料世导系空只得水合单严战以。真价美叫同明常专产重高一学行属。劳子响目圆金大流史结用条量学却。许断老将列出局参王便口业之生空并。点水省团是者今目月查记龙况生。中决因广一拉料主是军务给际次小。金好少资金资较用军新金类质千己号结。资然般油去王主消划农列长动半。究强类其都入严且斯需至精处他报上权。特片状更二开于调学且社论又西再铁二身。个断极教反见便动给验及华千导众或事。来解消细只住院军通果步千置想系议采。质极世因例会总图当就身步物委那过。运进色角史状万养上观装向已电军。空金示温达和志会照节派习他比。习处不技较主命面写王价场通层山。系满本离导去应级研共验加产产特之。族一知日在统战六规社且意边部。极后下风素能或技习阶往四由。看圆将消马步铁斯用物保算更红别毛风。利好划习声干置易整强标所八段。战矿入加矿学所情计内商路东别。家里处维经总人外型力金合出口级华。提低起况都争思比除满再育团年角由问干。光叫土美公连选加深以厂什。我手会还关具必持素工间级车计交月。回情火是变发走但存交老研制容件量改。进体头书正候门队程作体目千细市。业全人总价电气然八角铁比际识往点矿。起成极约期形以联拉题油走产线。本论最地反如完改京指种快日价。分上力色向立状资正千多看特派月证活。或起养使高斗学百此运图专意年料构。被效内少专构属照我五音难。们无及分行引照种象气条是提县位。什什表片须老段决子步造张定照式。军气各无际县样算好走体引想。认时东定活备极进四都也合化才。党一形万毛合展规前回劳务战。情过斯话石太查国面斯从究给根水。件律线特革安素领多九程程边见状条话。天料同行市话部理论多响支相设满。非身计海别厂中导际更志意调关速。高月群题放命今而式人角精党气局。用任常酸万半适许区八派究农高争。个北导济思理论见还状方关际。利的还十三边南指重算着般斗方统机总。快明利越准应五数共性难最。你准只具表几先素存深和记。手江以关算年值反何活联车增。百算总别见给被术计水难化气。运点选取劳二片比口大重领件因。团务生最量价领等委流红美管。精花却给意最己习实连带价什车不就。感圆她命应矿北车证才需强标红毛还。做想公八命东须金争议合消再。米华世子美然家天常导边道写划低容。极油前反想比里亲六参六厂百反却。选身县断交着办头龙团音走界方难。标厂查强车指五想生造增战见目只教照。易始使真成当车回白以究书表石设完基。知革史报来都设加使件细我达活统书积从。须起自们及与建放联直学火老支。斗机太公就派它过采铁期包当老商太。界保回特象论花极后统里装法快府。这流文约容气解以种形论方行到科阶党政。记圆最里适目往没消天入北上起。于议比原争育子严新产着石真其。结命确达往已器除机点线声定离认在易。只持作个调白次位布常常约便平世作。几算书从而度天团亲层建话海济他导多但。当必走传办马带书大火战现建油米安。家领特广并都联两门意结少。太目他金料中反界立包率这。及备始律出县术维向派间红型。增再品十定直放量省矿小者期实色装国科。反我区华越世点油根经种年。子么合委万看红处文信完证已美叫局农。号活车七院须清建马却起对处前。斯便再见已清组农代即质化着口龙表。理或增做支把要目文单子确天节类。理在火界红时受资构心事造米率个。儿众着研场组专内西传识无。公题后金派农程目任真按响图力学查。为七海复种级的压问着实听联实铁至特。半图联区片日调这步社红相所少众才。情元强维候听认老质心组油入林规志团。两具快来何区始受记委据作。算表习值日队长工月装面方争同象边路。反料观层军写元例多性部式话革。置极受给家百革学上构边段历列然毛根非。象史路听至极毛制识价主参总科然西。直给政种周加研切应流市每料表线。至矿在义想所只白直林只积千或。更半积拉种织根识较等太手日等产强。们着无还应具目物省系一热响文完毛委。相意回使年万准眼提接维领社。不了三联力花单子受各议阶。林过市件段总率选置论新合。给压员制南养一色去参放展见选备指。或极正属手王温例特热科制总极育打。层查本包体且规集之动土段计头。证流五术三马温不决整装运深形及易至。在信周件身备特院复一力直。界广非图力书那重给认切对并究。好美层己业上个克济选这细清人。日造江战王也代保公实影情老气法。手强风效车单美并形且越称四。张世动对圆常或断命每政当精。治定深便空内想到斗数斗阶热油北调数。没进克运见半平种或解目的原照步。运运火建水式按原万方界区。向这定才派际厂南史热见律们成。热你运已上土林这温圆开军基或老利观。作机适者用际产海南见已世政。各热头工则办然什一受油作由油出县。他称就许出铁放开事文后品单群。叫专则更算次马面花义始果务。标因口铁必日劳严众前好技专真太局无动。家广了清义回高不从写明加众比。时团日志就者周划好照小支明特各战。况术根极展解应然政温资重府极用百红。该件称该确转己铁步层边专两量种工易。候民程意安书四事县党东式是南。切意省算报火开精志为小需接引常干安。便律指理计写金高构度江天声展团特太则。格属收面二活务存石带例外更中北由造。细阶起观件国今效酸土水革做。委外空原观决争没门统集观重象多任。北时名石半引布当本按图三热存。口全它书思务情维段华音以前海理热路。近义给较问海意点始济种型声备好议新张。通只光术无劳厂理使易前持变。相料家深类真选意明外称也间证务美则。工体毛地流就交青运内装相研。相它切属达正况整般构划极划我很价。上研原下全酸层必九况打她段农么。她是重取府照众条派持空才又这老气那。这步法工例满员才行山就也把说空美。过理平提回学历九毛这斗头些群。白想立交打战千则特类复接边拉局。你器拉农干南江西持么音气装。出事人低没系听县率建面开口种车。外七花今备设运育方影些且极科加。通称给料领务府取第规备只之。用那导值存音化至响下个广色。之几名世百太个计压口油计文图。八空京关入不结给大被为区目量。断除类要位也次去为教安小方现地体。且入南同矿能位铁联飞象委克书。半见农准养位号事律边约根技改影。记资红影分治号而安段须照年放化收。且标张们说往即酸次类处系目程门果品。带价她情声业象已但何万清标收。资率定温观热本权给地具七来。热基说才活叫马容决海花研选点华品。有三形会料完口度公了真西容示。条技很治老计内国今压共头。没更查计量矿圆斯位管动生身华便在见规。京布记不太京导十代明团解据。压儿石保物证便律极每红提特听。存般下最矿型关很好始每能海日都么。热统话济队许运程温分历至儿反切切除。证身其活参以片问则打县三都各。何高不严清据民该全北改表变流公员道。步火市复结持各展程按信经别安当会听例。她月究物为积小半非业劳两或样则外。军公开连军群热联价员识知总。制习小存题决导派之比千不公率间战。一合况你红战些权次据较各备响。是文生设越直目层她个将议然白。格外你关造西研值战群算置法龙决。',
            cover: 'https://randomuser.me/api/portraits/men/2.jpg',
            collectType: 1,
            favour: 48,
            comment: 4,
            parentId: [2],
        },
    ],
})

const active = ref(0)
const bookShare = ref()
const bookShareData = ref({})
const onShare = (item) => {
    bookShareData.value = item
    bookShare.value?.showShare()
}

const orderType = ref(0) //0按内容 1按收藏夹
const onToggleOrderType = () => {
    orderType.value === 0 ? orderType.value = 1 : orderType.value = 0
}

const isShowCreate = ref(false)
const bookList = list.value.bookmarkList
let lastBookmarkId = bookList[bookList.length - 1].id
const bookmarkItemRef = ref({
    id: lastBookmarkId++,
    folderTitle: '',
    depict: '',
    power: 1,
    default: true, //默认收藏夹
    childrenNum: 0,
})

const validator = {
    folderTitle: (val) => val.length <= 20,
    depict: (val) => val.length <= 300,
}
//显示新建/编辑收藏夹弹框
const addEditRef = ref('add') //create/edit
const bookmarkItemIndex = ref(-1)
const showBookmark = (type = 'add', params = {}, index = -1) => {
    if (type === 'edit') {
        bookmarkItemRef.value = params
        bookmarkItemIndex.value = index
    } else {
        bookmarkItemRef.value = {
            id: lastBookmarkId++,
            folderTitle: '',
            depict: '',
            power: 1,
            default: true, //默认收藏夹的id
            childrenNum: 0,
        }
    }
    addEditRef.value = type
    isShowCreate.value = true
}
provide('showBookmark', showBookmark)
const setDefault = () => {
    bookmarkItemRef.default = true
}
//submit 新建/编辑收藏夹
const createEditBookmark = () => {
    addEditRef.value === 'add'
        ? list.value.bookmarkList.push(bookmarkItemRef.value)
        : (list.value.bookmarkList[bookmarkItemIndex.value] =
            bookmarkItemRef.value)
    isShowCreate.value = false
}
const updateBookmark = (
    sonData = { checked: [], curItem: {} }
) => {
    const { checked, curItem } = sonData
    //当前item在collectList中的索引
    const curSonIndex = list.value.collectList.findIndex(
        (item) => item.id === curItem.id
    )
    checked.forEach((val, index) => {
        const bookmarkId = list.value.bookmarkList[index].id
        if (val === true && !curItem.parentId.includes(bookmarkId)) {
            curItem.parentId.push(bookmarkId)
            list.value.bookmarkList[index].childrenNum += 1
        }
        if (val === false && curItem.parentId.includes(bookmarkId)) {
            //当前书签文件夹id在collectList的item中的parentId的索引
            const parentIdIndex = curItem.parentId.findIndex(
                (item) => item === bookmarkId
            )
            curItem.parentId.splice(parentIdIndex, 1)
            curItem.parentId.length === 0 &&
                list.value.collectList.splice(curSonIndex, 1)
            list.value.bookmarkList[index].childrenNum -= 1
            list.value.allNum -= 1
        }
    })
}
</script>
<style scoped lang="scss">
.collect-page {
    background: #fff;
    font-size: 12px;

    .explain {
        background: #faf7f7;
        line-height: 40px;
    }

    .tips {
        line-height: 50px;
        text-align: center;
    }

    .power-tips {
        margin: 4px 0;
    }

    .btn-set-default {
        margin: 4px 0;
    }

    .btn-submit {
        right: 0;
        top: 0;
        color: var(--color-blue-text);
    }
}
</style>
